In [1]:
%matplotlib inline
import numpy as np
import numpy.ma as ma
import pandas as pd
from pandas import DataFrame, Series
import matplotlib.pyplot as plt
import seaborn as sns
import timeit
import line_profiler

import datetime

from io import StringIO
from pandas.api.types import CategoricalDtype

import pandas._testing as tm

In [49]:
df_flow = pd.DataFrame(
[[pd.Timestamp('2012-05-12'),1,-50],
[pd.Timestamp('2013-09-04'),1,100],
[pd.Timestamp('2014-05-05'),1,300],
[pd.Timestamp('2013-09-04'),2,-700],
[pd.Timestamp('2015-05-12'),2,1000],
[pd.Timestamp('2012-04-04'),3,100],
[pd.Timestamp('2013-05-12'),3,-50],
[pd.Timestamp('2013-09-04'),4,-60]],
columns= ['DATE','Investment','Flow'])
df_flow.sort_values('DATE', inplace=True)
df_flow

        DATE  Investment  Flow
5 2012-04-04           3   100
0 2012-05-12           1   -50
6 2013-05-12           3   -50
1 2013-09-04           1   100
3 2013-09-04           2  -700
7 2013-09-04           4   -60
2 2014-05-05           1   300
4 2015-05-12           2  1000

In [35]:
df_stock = pd.DataFrame(
[[pd.Timestamp('2012-09-05'),1,400],
[pd.Timestamp('2014-05-05'),1,600],
[pd.Timestamp('2014-05-05'),2,300],
[pd.Timestamp('2013-09-04'),2,800],
[pd.Timestamp('2012-09-14'),3,1000],
[pd.Timestamp('2013-09-05'),4,6000]],
columns=['DATE', 'Investment','Stock'])
df_stock.sort_values('DATE', inplace=True)
df_stock

        DATE  Investment  Stock
0 2012-09-05           1    400
4 2012-09-14           3   1000
3 2013-09-04           2    800
5 2013-09-05           4   6000
1 2014-05-05           1    600
2 2014-05-05           2    300

In [148]:
dft = pd.merge_asof(df_flow.rename(columns={'DATE':'DateFlow'}),
    df_stock.rename(columns={'DATE':'DateStock'}),
               left_on='DateFlow',
               right_on='DateStock',              
               by='Investment')
dft

    DateFlow  Investment  Flow  DateStock   Stock
0 2012-04-04           3   100        NaT     NaN
1 2012-05-12           1   -50        NaT     NaN
2 2013-05-12           3   -50 2012-09-14  1000.0
3 2013-09-04           1   100 2012-09-05   400.0
4 2013-09-04           2  -700 2013-09-04   800.0
5 2013-09-04           4   -60        NaT     NaN
6 2014-05-05           1   300 2014-05-05   600.0
7 2015-05-12           2  1000 2014-05-05   300.0

In [159]:
dftt = dft.melt(id_vars=['Investment','DateStock', 'DateFlow'],
               value_name='Flow+Stock').sort_values('Investment')
#dftt['DateStock'] = np.where(dftt.variable.eq('Stock'),dftt.DateStock, dftt.DateStock)
dftt.head()

    Investment  DateStock   DateFlow variable  Flow+Stock
1            1        NaT 2012-05-12     Flow       -50.0
3            1 2012-09-05 2013-09-04     Flow       100.0
6            1 2014-05-05 2014-05-05     Flow       300.0
9            1        NaT 2012-05-12    Stock         NaN
11           1 2012-09-05 2013-09-04    Stock       400.0

In [162]:
dftt = dftt[['DateFlow','Investment', 'Flow+Stock']].rename(columns={'DateStock':'DATE'}).reset_index(drop=True)
dftt.dropna().head(6)

    DateFlow  Investment  Flow+Stock
0 2012-05-12           1       -50.0
1 2013-09-04           1       100.0
2 2014-05-05           1       300.0
4 2013-09-04           1       400.0
5 2014-05-05           1       600.0
6 2013-09-04           2      -700.0

In [ ]:
dftt

In [101]:
dftt = dft.melt(id_vars=['Investment','DateStock', 'DateFlow'],
               value_name='Flow+Stock').sort_values('Investment')
dftt['DateStock'] = np.where(dftt.variable.eq('Flow'),dftt.DateFlow, dftt.DateStock)
dftt = dftt[['DateStock', 'Investment', 'Flow+Stock']].rename(columns={'DateStock':'DATE'}).reset_index(drop=True)
dftt.tail()

         DATE  Investment  Flow+Stock
7  2013-09-04           2        -700
8  2012-09-14           3        1000
9  2012-04-04           3         100
10 2013-09-05           4        6000
11 2013-09-04           4         -60

In [115]:
uniqueInvestment = dftt.Investment.unique()
#create a data frame dictionary to store your data frames
DataFrameDict = {elem:('df'+str(elem)) for elem in uniqueInvestment}
DataFrameDict

'df1'

In [119]:
for uniqueInvestment in dftt.Investment.unique():
    print(dftt.loc[dftt.Investment == uniqueInvestment])

        DATE  Investment  Flow+Stock
0 2012-09-05           1         400
1 2014-05-05           1         600
2 2012-05-12           1         -50
3 2014-05-05           1         300
        DATE  Investment  Flow+Stock
4 2013-09-04           2         800
5 2014-05-05           2         300
6 2013-09-04           2        -700
7 2013-09-04           2        -700
        DATE  Investment  Flow+Stock
8 2012-09-14           3        1000
9 2012-04-04           3         100
         DATE  Investment  Flow+Stock
10 2013-09-05           4        6000
11 2013-09-04           4         -60

In [118]:
'1'

'1'

In [136]:
df_flow = pd.DataFrame(
[[pd.Timestamp('2012-05-12'),1,-50],
[pd.Timestamp('2013-09-04'),1,100],
[pd.Timestamp('2014-05-05'),1,300],
[pd.Timestamp('2013-09-04'),2,-700],
[pd.Timestamp('2015-05-12'),2,1000],
[pd.Timestamp('2012-04-04'),3,100],
[pd.Timestamp('2013-05-12'),3,-50],
[pd.Timestamp('2013-09-04'),4,-60]],
columns= ['DATE','Investment','Flow'])
df_flow.sort_values('DATE', inplace=True)
df_flow

        DATE  Investment  Flow
5 2012-04-04           3   100
0 2012-05-12           1   -50
6 2013-05-12           3   -50
1 2013-09-04           1   100
3 2013-09-04           2  -700
7 2013-09-04           4   -60
2 2014-05-05           1   300
4 2015-05-12           2  1000

In [137]:
df_stock = pd.DataFrame(
[[pd.Timestamp('2012-09-05'),1,400],
[pd.Timestamp('2014-05-05'),1,600],
[pd.Timestamp('2014-05-05'),2,300],
[pd.Timestamp('2013-09-04'),2,800],
[pd.Timestamp('2012-09-14'),3,1000],
[pd.Timestamp('2013-09-05'),4,6000]],
columns=['DATE', 'Investment','Stock'])
df_stock.sort_values('DATE', inplace=True)
df_stock

        DATE  Investment  Stock
0 2012-09-05           1    400
4 2012-09-14           3   1000
3 2013-09-04           2    800
5 2013-09-05           4   6000
1 2014-05-05           1    600
2 2014-05-05           2    300

In [138]:
df_m = pd.merge_asof(df_stock.rename(columns={'DATE':'DateStock'}),
               df_flow.rename(columns={'DATE':'DateFlow'}),
               left_on='DateStock',
               right_on='DateFlow',              
               by='Investment')
df_m

   DateStock  Investment  Stock   DateFlow  Flow
0 2012-09-05           1    400 2012-05-12   -50
1 2012-09-14           3   1000 2012-04-04   100
2 2013-09-04           2    800 2013-09-04  -700
3 2013-09-05           4   6000 2013-09-04   -60
4 2014-05-05           1    600 2014-05-05   300
5 2014-05-05           2    300 2013-09-04  -700

In [134]:
df_m = df_m.melt(id_vars=['Investment','DateStock', 'DateFlow'],
               value_name='Flow+Stock').sort_values('Investment')
df_m['DateStock'] = np.where(df_m.variable.eq('Flow'),df_m.DateFlow, df_m.DateStock)
df_m = df_m[['DateStock', 'Investment', 'Flow+Stock']].rename(columns={'DateStock':'DATE'}).reset_index(drop=True)

         DATE  Investment  Flow+Stock
7  2013-09-04           2        -700
8  2012-09-14           3        1000
9  2012-04-04           3         100
10 2013-09-05           4        6000
11 2013-09-04           4         -60

In [185]:
df_n = df_m

In [186]:
for uniqueInvestment in df_n.Investment.unique():
    print(df_n.loc[df_n.Investment == uniqueInvestment])

   DateStock  Investment  Stock   DateFlow  Flow
0 2012-09-05           1    400 2012-05-12   -50
4 2014-05-05           1    600 2014-05-05   300
   DateStock  Investment  Stock   DateFlow  Flow
1 2012-09-14           3   1000 2012-04-04   100
   DateStock  Investment  Stock   DateFlow  Flow
2 2013-09-04           2    800 2013-09-04  -700
5 2014-05-05           2    300 2013-09-04  -700
   DateStock  Investment  Stock   DateFlow  Flow
3 2013-09-05           4   6000 2013-09-04   -60

In [178]:
df = pd.DataFrame(
[[1, pd.Timestamp('2012-03-04')],
[1, pd.Timestamp('2013-04-15')],
[1, pd.Timestamp('2019-01-09')],
[2, pd.Timestamp('2013-04-09')],
[2, pd.Timestamp('2016-01-01')],
[2, pd.Timestamp('2018-05-09')]],
 columns=['ID','DATE']   
)
df

   ID       DATE
0   1 2012-03-04
1   1 2013-04-15
2   1 2019-01-09
3   2 2013-04-09
4   2 2016-01-01
5   2 2018-05-09

In [179]:
df.groupby('ID').agg(list).reset_index()

   ID                                               DATE
0   1  [2012-03-04 00:00:00, 2013-04-15 00:00:00, 201...
1   2  [2013-04-09 00:00:00, 2016-01-01 00:00:00, 201...

In [182]:
df = pd.DataFrame({"Col1": [10, 20, 15, 30, 45],
                  "Col2": [13, 23, 18, 33, 48],
                  "Col3": [17, 27, 22, 37, 52]},
                  index=pd.date_range("11:00", "13:00", freq="30min"))
df.resample('10T').asfreq()

                     Col1  Col2  Col3
2021-04-22 11:00:00  10.0  13.0  17.0
2021-04-22 11:10:00   NaN   NaN   NaN
2021-04-22 11:20:00   NaN   NaN   NaN
2021-04-22 11:30:00  20.0  23.0  27.0
2021-04-22 11:40:00   NaN   NaN   NaN
2021-04-22 11:50:00   NaN   NaN   NaN
2021-04-22 12:00:00  15.0  18.0  22.0
2021-04-22 12:10:00   NaN   NaN   NaN
2021-04-22 12:20:00   NaN   NaN   NaN
2021-04-22 12:30:00  30.0  33.0  37.0
2021-04-22 12:40:00   NaN   NaN   NaN
2021-04-22 12:50:00   NaN   NaN   NaN
2021-04-22 13:00:00  45.0  48.0  52.0

In [219]:
import pandas as pd

df = pd.DataFrame({"Point": ["A", "B", "C"], "x": [10, 20, 30], "y": [1, 2, 3]})

df["XX"] = 1

result = (
    df.merge(df, on="XX")
    .assign(distance=lambda d: (d["x_x"] - d["x_y"]) ** 2 + (d["y_x"] - d["y_y"]) ** 2)
    .loc[:, ["Point_x", "Point_y", "distance"]]
    .pivot(index="Point_x", columns="Point_y")
)
result

        distance
Point_y        A    B    C
Point_x
A              0  101  404
B            101    0  101
C            404  101    0

In [216]:
import pandas as pd

df = pd.DataFrame({"Point": ["A", "B", "C"], "x": [10, 20, 30], "y": [1, 2, 3]})

df["XX"] = 1

df

  Point   x  y  XX
0     A  10  1   1
1     B  20  2   1
2     C  30  3   1

In [217]:
df.merge(df, on="XX")
    #.assign(distance=lambda d: (d["x_x"] - d["x_y"]) ** 2 + (d["y_x"] - d["y_y"]) ** 2)
    #.loc[:, ["Point_x", "Point_y", "distance"]]
    #.pivot(index="Point_x", columns="Point_y")

  Point_x  x_x  y_x  XX Point_y  x_y  y_y
0       A   10    1   1       A   10    1
1       A   10    1   1       B   20    2
2       A   10    1   1       C   30    3
3       B   20    2   1       A   10    1
4       B   20    2   1       B   20    2
5       B   20    2   1       C   30    3
6       C   30    3   1       A   10    1
7       C   30    3   1       B   20    2
8       C   30    3   1       C   30    3

In [406]:
df1 = pd.DataFrame({
    "key1": ['K', 'K', 'A1', 'A2', 'B1', 'B9', 'C3'],
    "key2": ['a5', 'a4', 'a7', 'a9', 'b2', 'b8', 'c1'],
    "Value1": ['apple', 'guava', 'kiwi', 'grape', 'banana', 'peach', 'berry'],
})
df2 = pd.DataFrame({
    "key1": ['K', 'A1', 'A3', 'B1', 'C2', 'C3'],
    "key2": ['a9', 'a7', 'a9', 'b2', 'c7', 'c1'],
    "Value2": ['apple', 'kiwi', 'grape', 'banana', 'guava', 'orange'],
})
df2

  key1 key2  Value2
0    K   a9   apple
1   A1   a7    kiwi
2   A3   a9   grape
3   B1   b2  banana
4   C2   c7   guava
5   C3   c1  orange

In [430]:
df1.merge(df2, on=['key1', 'key2'], how='outer').merge(df1, how='left')

  key1 key2  Value1  Value2
0    K   a5   apple     NaN
1    K   a4   guava     NaN
2   A1   a7    kiwi    kiwi
3   A2   a9   grape     NaN
4   B1   b2  banana  banana
5   B9   b8   peach     NaN
6   C3   c1   berry  orange
7    K   a9     NaN   apple
8   A3   a9     NaN   grape
9   C2   c7     NaN   guava

In [463]:
df = pd.DataFrame([
['Peter','en',1],
['Petrus','latin',1],
['Peter','de',1],
['Victor','en',2],
['Victor','latin',2],
['Claudius','latin',3],
['Claudio','spanish',3]],
columns=['name','language','gr_id']
)
df

       name language  gr_id
0     Peter       en      1
1    Petrus    latin      1
2     Peter       de      1
3    Victor       en      2
4    Victor    latin      2
5  Claudius    latin      3
6   Claudio  spanish      3

In [500]:
df1 = df.pivot(index='gr_id', columns='language')
np.where(df2.name.isin(df1.name),1,2)

array([2, 2, 2])

In [501]:
df1.name

language     de      en     latin  spanish
gr_id
1         Peter   Peter    Petrus      NaN
2           NaN  Victor    Victor      NaN
3           NaN     NaN  Claudius  Claudio

In [526]:
df.pivot(columns=['gr_id'], index='language').name

gr_id          1       2         3
language
de         Peter     NaN       NaN
en         Peter  Victor       NaN
latin     Petrus  Victor  Claudius
spanish      NaN     NaN   Claudio

In [505]:
from io import StringIO
import csv
data = """app_id_dummy,alert_type,timestamp,session_id
test,active,1618870097991,63f3eded98
test,active,1618869937038,ea86303028
test,active,1618869423974,55e809427a"""

dia = csv.excel()
dia.quoting = csv.QUOTE_NONE
pd.read_csv(StringIO(data), dialect=dia)

  app_id_dummy alert_type      timestamp  session_id
0         test     active  1618870097991  63f3eded98
1         test     active  1618869937038  ea86303028
2         test     active  1618869423974  55e809427a

In [57]:
df = pd.DataFrame([
[1, 'mcma',123],
[1,'mcms',124],
[1,'mcda',125],
[1,'mcds',126],
[2,'cic',127],
[2,'cmc',128]],
columns=['id','type','ip'])

In [59]:
(df.assign(ip = df['ip'].where(df['type'].eq('mcma')))
        .groupby('id')
        .agg(type=('type',list), ip=('ip','first'))
        .reset_index())

   id                      type     ip
0   1  [mcma, mcms, mcda, mcds]  123.0
1   2                [cic, cmc]    NaN

In [61]:
df.groupby('id').agg(list)

                        type                    ip
id
1   [mcma, mcms, mcda, mcds]  [123, 124, 125, 126]
2                 [cic, cmc]            [127, 128]

In [94]:
df = pd.DataFrame({'id':['x1', 'x1', 'x1', 'x2', 'x2', 'x2', 'x2']
   ,  'beg':['2021-01-01 00:00:00',
   '2021-02-03 00:00:00','2021-02-04 00:00:00','2021-02-05 00:00:00',
   '2021-02-06 00:00:00','2021-03-05 00:00:00','2021-04-01 00:00:00'],
      'end':['2021-01-02 00:00:00 ',
   '2021-02-03 12:00:00','2021-02-04 10:00:00','2021-02-05 10:00:00',
   '2021-02-06 10:00:00','2021-03-07 10:00:00','2021-05-08 00:00:00']})
df

   id                  beg                   end
0  x1  2021-01-01 00:00:00  2021-01-02 00:00:00
1  x1  2021-02-03 00:00:00   2021-02-03 12:00:00
2  x1  2021-02-04 00:00:00   2021-02-04 10:00:00
3  x2  2021-02-05 00:00:00   2021-02-05 10:00:00
4  x2  2021-02-06 00:00:00   2021-02-06 10:00:00
5  x2  2021-03-05 00:00:00   2021-03-07 10:00:00
6  x2  2021-04-01 00:00:00   2021-05-08 00:00:00

In [96]:
df = pd.concat([pd.Series(r.id,pd.date_range(r.beg, r.end, freq='H')) for r in df.itertuples()]).reset_index()
df.columns=['date','id']

df = df.groupby(['id', df['date'].dt.strftime('%m/%Y')]).size().reset_index(name='count')
print (df)

   id     date  count
0  x1  01/2021     25
1  x1  02/2021     24
2  x2  02/2021     22
3  x2  03/2021     59
4  x2  04/2021    720
5  x2  05/2021    169